back/app/controllers/missions_controller.rb

  def create
    if params[:team_id].present?  # チームに紐づくミッション
      team = Team.find(params[:team_id])
      @mission = team.missions.build(mission_params)
      @mission.user = current_user  # 作成者を設定
    else  # 個人ミッション
      @mission = current_user.missions.build(mission_params)
    end

    if @mission.save
---
INSERT INTO "missions" ("name", "description", "owner_type", "user_id", "team_id", "is_completed", "created_at", "updated_at", "deadline") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def edit
    @mission = Mission.find(params[:id])
---
SELECT "missions".* FROM "missions" WHERE "missions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def update
    @mission = Mission.find(params[:id])
    if @mission.update(mission_params)
---
SELECT "missions".* FROM "missions" WHERE "missions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "missions" SET "description" = $1, "updated_at" = $2 WHERE "missions"."id" = $3  [["description", "Mission2-1-1-1\n"], ["updated_at", "2024-11-10 15:52:48.145826"], ["id", 4]]

  def destroy
    @mission.destroy
---
DELETE FROM "missions" WHERE "missions"."id" = $1  [["id", 4]]

  def set_mission
    @mission = Mission.find(params[:id])
---
SELECT "missions".* FROM "missions" WHERE "missions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def check_permission
    unless @mission.user == current_user || (@mission.team && @mission.team.users.include?(current_user))
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]