back/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."created_by_user_id" = $1 ORDER BY "tasks"."created_at" DESC  [["created_by_user_id", 3]]
SELECT "teams"."id" FROM "teams" INNER JOIN "user_team_relations" ON "teams"."id" = "user_team_relations"."team_id" WHERE "user_team_relations"."user_id" = $1  [["user_id", 1]]
---
  def index
    @tasks = current_user.tasks.includes(:mission, :created_by_user).order(created_at: :desc)
    @missions = Mission.where(user_id: current_user.id).or(Mission.where(team_id: current_user.teams.pluck(:id)))

INSERT INTO "tasks" ("title", "description", "mission_id", "created_by_user_id", "assigned_user_id", "team_id", "progress_rate", "status", "created_at", "updated_at", "deadline") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @task = Task.new(task_params)
    @task.created_by_user_id = current_user.id
    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "teams"."id" FROM "teams" INNER JOIN "user_team_relations" ON "teams"."id" = "user_team_relations"."team_id" WHERE "user_team_relations"."user_id" = $1  [["user_id", 1]]
---
  def edit
    @task = Task.find(params[:id])
    @missions = Mission.where(user_id: current_user.id).or(Mission.where(team_id: current_user.teams.pluck(:id)))

UPDATE "tasks" SET "progress_rate" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["progress_rate", 100], ["updated_at", "2024-11-21 13:37:06.276142"], ["id", 1]]
---
  def update
    if @task.update(task_params)