back/app/controllers/api/v1/contacts_controller.rb

INSERT INTO "contacts" ("name", "email", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "a"], ["email", "test@gmail.com"], ["message", "test3"], ["created_at", "2025-01-16 00:11:42.989416"], ["updated_at", "2025-01-16 00:11:42.989416"]]
---
      def create
        Rails.logger.info "Received params: #{params.inspect}" # リクエストパラメータをログに記録
        contact = Contact.new(contact_params)
        if contact.save