back/app/controllers/api/v1/missions_controller.rb

SELECT "teams"."id" FROM "teams" INNER JOIN "user_team_relations" ON "teams"."id" = "user_team_relations"."team_id" WHERE "user_team_relations"."user_id" = $1  [["user_id", 13]]
SELECT "missions".* FROM "missions" WHERE "missions"."deleted_at" IS NULL AND "missions"."user_id" = $1 AND "missions"."user_id" IS NOT NULL AND "missions"."team_id" IS NULL AND (progress < 100) AND "missions"."deleted_at" IS NULL  [["user_id", 13]]
---
      def index
        personal_missions = current_api_v1_user.missions.personal.includes(:tasks).where(deleted_at: nil)
        team_ids = current_api_v1_user.teams.pluck(:id)
        team_missions = Mission.joins(:team).where(teams: { id: team_ids }).includes(:tasks).where(deleted_at: nil)

        render json: {
          personal_missions: personal_missions.map { |mission| serialize_mission_with_progress(mission) },
          team_missions: team_missions.map { |mission| serialize_mission_with_progress(mission) }

INSERT INTO "missions" ("name", "description", "owner_type", "user_id", "team_id", "is_completed", "created_at", "updated_at", "deadline", "progress") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
      def create
        if params[:team_id].present?
          begin
            team = Team.find(params[:team_id])
            @mission = team.missions.build(mission_params.merge(user: current_api_v1_user))
          rescue ActiveRecord::RecordNotFound
            render json: { errors: ['指定されたチームが存在しません。'] }, status: :not_found
            return
          end
        else
          @mission = current_api_v1_user.missions.build(mission_params)
        end

        if @mission.save